Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFE100.atdf
         <register caption="Configuration Register 3; CP0 Register 16, Select 3" name="Config3" offset="0x108" rw="RW" size="4">
            <bitfield caption="Trace Logic bit" mask="0x00000001" name="TL" values="Config3__TL"/>
            <bitfield caption="Common Device Memory Map bit" mask="0x00000008" name="CDMM" values="Config3__CDMM"/>
            <bitfield caption="Small Page bit" mask="0x00000010" name="SP" values="Config3__SP"/>
            <bitfield caption="Vector Interrupt bit" mask="0x00000020" name="VInt" values="Config3__VInt"/>
            <bitfield caption="External Vector Interrupt Controller bit" mask="0x00000040" name="VEIC" values="Config3__VEIC"/>
            <bitfield caption="Indicates that iFlowtrace hardware is present" mask="0x00000100" name="ITL" values="Config3__ITL"/>
            <bitfield caption="MIPS DSP ASE Presence bit" mask="0x00000400" name="DSPP" values="Config3__DSPP"/>
            <bitfield caption="MIPS DSP ASE Revision 2 Presence bit" mask="0x00000800" name="DSP2P" values="Config3__DSP2P"/>
            <bitfield caption="RIE and XIE Implemented in PageGrain bit" mask="0x00001000" name="RXI" values="Config3__RXI"/>
            <bitfield caption="UserLocal Register Implemented bit" mask="0x00002000" name="ULRI" values="Config3__ULRI"/>
            <bitfield caption="Instruction Set Availability bits" mask="0x0000C000" name="ISA" values="Config3__ISA"/>
            <bitfield caption="ISA on Exception bit" mask="0x00010000" name="ISAONEXC" values="Config3__ISAONEXC"/>
            <bitfield caption="MIPS MCU ASE Implemented bit" mask="0x00020000" name="MCU" values="Config3__MCU"/>
            <bitfield caption="microMIPS Architecture Revision Level bits" mask="0x001C0000" name="MMAR" values="Config3__MMAR"/>
            <bitfield caption="Width of the Status IPL and Cause RIPL bits" mask="0x00600000" name="IPLW" values="Config3__IPLW"/>
            <bitfield mask="0x00800000" name="VZ"/>
            <bitfield mask="0x80000000" name="M"/>
         </register>
         <register caption="" name="Config4" offset="0x10c" rw="R" size="4">
            <bitfield mask="0x80000000" name="M"/>
         </register>
         <register caption="Configuration Register 5; CP0 Register 16, Select 5" name="Config5" offset="0x110" rw="RW" size="4">
            <bitfield caption="Nested Fault bit" mask="0x00000001" name="NF" values="Config5__NF"/>
            <bitfield mask="0x00000004" name="UFR"/>
            <bitfield mask="0x80000000" name="M"/>
         </register>
         <register caption="Configuration Register 7; CP0 Register 16, Select 7" name="Config7" offset="0x114" rw="R" size="4">
            <bitfield mask="0x00040000" name="HCI"/>
            <bitfield caption="Wait IE Ignore bit" mask="0x80000000" name="WII" values="Config7__WII"/>
         </register>
         <register caption="" name="LLAddr" offset="0x118" rw="R" size="4">
            <bitfield mask="0x0FFFFFFF" name="PAddr"/>
         </register>
         <register caption="" name="WatchLo" offset="0x11c" rw="RW" size="4">
            <bitfield mask="0x00000001" name="W"/>
            <bitfield mask="0x00000002" name="R"/>
            <bitfield mask="0x00000004" name="I"/>
            <bitfield mask="0xFFFFFFF8" name="VAddr"/>
         </register>
         <register caption="" name="WatchLo1" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x00000001" name="W"/>
            <bitfield mask="0x00000002" name="R"/>
            <bitfield mask="0x00000004" name="I"/>
            <bitfield mask="0xFFFFFFF8" name="VAddr"/>
         </register>
         <register caption="" name="WatchLo2" offset="0x124" rw="RW" size="4">
            <bitfield mask="0x00000001" name="W"/>
            <bitfield mask="0x00000002" name="R"/>
            <bitfield mask="0x00000004" name="I"/>
            <bitfield mask="0xFFFFFFF8" name="VAddr"/>
         </register>
         <register caption="" name="WatchLo3" offset="0x128" rw="RW" size="4">
            <bitfield mask="0x00000001" name="W"/>
            <bitfield mask="0x00000002" name="R"/>
            <bitfield mask="0x00000004" name="I"/>
            <bitfield mask="0xFFFFFFF8" name="VAddr"/>
         </register>
         <register caption="" name="WatchHi" offset="0x12c" rw="RW" size="4">
            <bitfield mask="0x00000001" name="W"/>
            <bitfield mask="0x00000002" name="R"/>
            <bitfield mask="0x00000004" name="I"/>
            <bitfield mask="0x00000FF8" name="Mask"/>
            <bitfield mask="0x00FF0000" name="ASID"/>
            <bitfield mask="0x40000000" name="G"/>
            <bitfield mask="0x80000000" name="M"/>
         </register>
         <register caption="" name="WatchHi1" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x00000001" name="W"/>
            <bitfield mask="0x00000002" name="R"/>
            <bitfield mask="0x00000004" name="I"/>
            <bitfield mask="0x00000FF8" name="Mask"/>
            <bitfield mask="0x00FF0000" name="ASID"/>
            <bitfield mask="0x40000000" name="G"/>
            <bitfield mask="0x80000000" name="M"/>
         </register>
         <register caption="" name="WatchHi2" offset="0x134" rw="RW" size="4">
            <bitfield mask="0x00000001" name="W"/>
            <bitfield mask="0x00000002" name="R"/>
            <bitfield mask="0x00000004" name="I"/>
            <bitfield mask="0x00000FF8" name="Mask"/>
            <bitfield mask="0x00FF0000" name="ASID"/>
            <bitfield mask="0x40000000" name="G"/>
            <bitfield mask="0x80000000" name="M"/>
         </register>
         <register caption="" name="WatchHi3" offset="0x138" rw="RW" size="4">
            <bitfield mask="0x00000001" name="W"/>
            <bitfield mask="0x00000002" name="R"/>
            <bitfield mask="0x00000004" name="I"/>
            <bitfield mask="0x00000FF8" name="Mask"/>
            <bitfield mask="0x00FF0000" name="ASID"/>
            <bitfield mask="0x40000000" name="G"/>
            <bitfield mask="0x80000000" name="M"/>
         </register>
         <register caption="" name="Debug" offset="0x13c" rw="RW" size="4">
            <bitfield mask="0x00000001" name="DSS"/>
            <bitfield mask="0x00000002" name="DBp"/>
            <bitfield mask="0x00000004" name="DDBL"/>
            <bitfield mask="0x00000008" name="DDBS"/>
            <bitfield mask="0x00000010" name="DIB"/>
            <bitfield mask="0x00000020" name="DINT"/>
            <bitfield mask="0x00000040" name="DIBIMPR"/>
            <bitfield mask="0x00000100" name="SSt"/>
            <bitfield mask="0x00000200" name="NoSST"/>
            <bitfield mask="0x00007C00" name="DExcCode"/>
            <bitfield mask="0x00038000" name="Ver"/>
            <bitfield mask="0x00040000" name="DDBLImpr"/>
            <bitfield mask="0x00080000" name="DDBSImpr"/>
            <bitfield mask="0x00100000" name="IEXI"/>
            <bitfield mask="0x00200000" name="DBusEP"/>
            <bitfield mask="0x01000000" name="IBusEP"/>
            <bitfield mask="0x02000000" name="CountDM"/>
            <bitfield mask="0x04000000" name="Halt"/>
            <bitfield mask="0x08000000" name="Doze"/>
            <bitfield mask="0x10000000" name="LSNM"/>
            <bitfield mask="0x20000000" name="NoDCR"/>
            <bitfield mask="0x40000000" name="DM"/>
            <bitfield mask="0x80000000" name="DBD"/>
         </register>
         <register caption="" name="TraceControl" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x00000001" name="On"/>
            <bitfield mask="0x0000000E" name="Mode"/>
            <bitfield mask="0x00000010" name="G"/>
            <bitfield mask="0x00001FE0" name="ASID"/>
            <bitfield mask="0x001FE000" name="ASID_M"/>
            <bitfield mask="0x00200000" name="U"/>
            <bitfield mask="0x00800000" name="K"/>
            <bitfield mask="0x01000000" name="E"/>
            <bitfield mask="0x02000000" name="D"/>
            <bitfield mask="0x04000000" name="IO"/>
            <bitfield mask="0x08000000" name="TB"/>
            <bitfield mask="0x40000000" name="UT"/>
            <bitfield mask="0x80000000" name="TS"/>
         </register>
         <register caption="" name="TraceControl2" offset="0x144" rw="R" size="4">
            <bitfield mask="0x00000007" name="SyP"/>
            <bitfield mask="0x00000008" name="TBU"/>
            <bitfield mask="0x00000010" name="TBI"/>
            <bitfield mask="0x00000060" name="ValidModes"/>
         </register>
