Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFE100.atdf
      <value-group caption="MMU Type bits" name="Config__MT">
         <value caption="M-Class MPU Microprocessor core uses a TLB-based MMU" name="" value="0x1"/>
      </value-group>
      <value-group caption="Architecture Revision Level bits" name="Config__AR">
         <value caption="MIPS32 Release 2" name="" value="0x1"/>
      </value-group>
      <value-group caption="Architecture Type bits" name="Config__AT">
         <value caption="MIPS32" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endian Mode bit" name="Config__BE">
         <value caption="Little-endian" name="" value="0x0"/>
      </value-group>
      <value-group caption="Burst Mode bit" name="Config__BM">
         <value caption="Burst order is sequential" name="" value="0x0"/>
      </value-group>
      <value-group caption="Merge Mode bits" name="Config__MM">
         <value caption="Merging is allowed" name="" value="0x2"/>
      </value-group>
      <value-group caption="Multiply/Divide Unit bit" name="Config__MDU">
         <value caption="Fast, high-performance MDU" name="" value="0x0"/>
      </value-group>
      <value-group caption="SimpleBE bit" name="Config__SB">
         <value caption="Only Simple Byte Enables are allowed on the internal bus interface" name="" value="0x1"/>
      </value-group>
      <value-group caption="User-defined bit" name="Config__UDI">
         <value caption="CorExtend User-Defined Instructions are not implemented" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Scratch Pad RAM bit" name="Config__DSP">
         <value caption="Data Scratch Pad RAM is not implemented" name="" value="0x0"/>
      </value-group>
      <value-group caption="Instruction Scratch Pad RAM bit" name="Config__ISP">
         <value caption="Instruction Scratch Pad RAM is not implemented" name="" value="0x0"/>
      </value-group>
      <value-group caption="Floating Point Unit bit" name="Config1__FP">
         <value caption="Floating Point Unit is present" name="" value="0x1"/>
      </value-group>
      <value-group caption="EJTAG Present bit" name="Config1__EP">
         <value caption="Core implements EJTAG" name="" value="0x1"/>
      </value-group>
      <value-group caption="Code Compression Implemented bit" name="Config1__CA">
         <value caption="No MIPS16e present" name="" value="0x0"/>
      </value-group>
      <value-group caption="Watch Register Presence bit" name="Config1__WR">
         <value caption="No Watch registers are present" name="" value="0x1"/>
      </value-group>
      <value-group caption="Performance Counter bit" name="Config1__PC">
         <value caption="The processor core contains Performance Counters" name="" value="0x1"/>
      </value-group>
      <value-group caption="Data-Cache Associativity bits" name="Config1__DA">
         <value caption="Contains the 4-way set associativity for the data cache" name="" value="0x3"/>
      </value-group>
      <value-group caption="Data-Cache Line bits" name="Config1__DL">
         <value caption="Contains data cache line size of 16 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Data-Cache Sets bits" name="Config1__DS">
         <value caption="Contains 64 data cache sets per way" name="" value="0x0"/>
      </value-group>
      <value-group caption="Instruction-Cache Associativity bits" name="Config1__IA">
         <value caption="Contains 4-way instruction cache associativity" name="" value="0x3"/>
      </value-group>
      <value-group caption="Instruction-Cache Line bits" name="Config1__IL">
         <value caption="Contains instruction cache line size of 16 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Instruction Cache Sets bits" name="Config1__IS">
         <value caption="Contains 256 instruction cache sets per way" name="" value="0x2"/>
      </value-group>
      <value-group caption="Trace Logic bit" name="Config3__TL">
         <value caption="Trace logic is not implemented" name="" value="0x0"/>
      </value-group>
      <value-group caption="Common Device Memory Map bit" name="Config3__CDMM">
         <value caption="CDMM is implemented" name="" value="0x1"/>
      </value-group>
      <value-group caption="Small Page bit" name="Config3__SP">
         <value caption="4 KB page size" name="" value="0x0"/>
      </value-group>
      <value-group caption="Vector Interrupt bit" name="Config3__VInt">
         <value caption="Vector interrupts are implemented" name="" value="0x1"/>
      </value-group>
      <value-group caption="External Vector Interrupt Controller bit" name="Config3__VEIC">
         <value caption="Support for an external interrupt controller is implemented" name="" value="0x1"/>
      </value-group>
      <value-group caption="Indicates that iFlowtrace hardware is present" name="Config3__ITL">
         <value caption="The iFlowtrace is implemented in the core" name="" value="0x1"/>
      </value-group>
      <value-group caption="MIPS DSP ASE Presence bit" name="Config3__DSPP">
         <value caption="DSP is present" name="" value="0x1"/>
      </value-group>
      <value-group caption="MIPS DSP ASE Revision 2 Presence bit" name="Config3__DSP2P">
         <value caption="DSP Revision 2 is present" name="" value="0x1"/>
      </value-group>
      <value-group caption="RIE and XIE Implemented in PageGrain bit" name="Config3__RXI">
         <value caption="RIE and XIE bits are implemented" name="" value="0x1"/>
      </value-group>
      <value-group caption="UserLocal Register Implemented bit" name="Config3__ULRI">
         <value caption="UserLocal Coprocessor 0 register is implemented" name="" value="0x1"/>
      </value-group>
      <value-group caption="Instruction Set Availability bits" name="Config3__ISA">
         <value caption="Both MIPS32 and microMIPS are implemented; microMIPS is used when coming out of reset" name="" value="0x3"/>
         <value caption="Both MIPS32 and microMIPS are implemented; MIPS32 ISA used when coming out of reset" name="" value="0x2"/>
      </value-group>
      <value-group caption="ISA on Exception bit" name="Config3__ISAONEXC">
         <value caption="microMIPS is used on entrance to an exception vector" name="" value="0x1"/>
         <value caption="MIPS32 ISA is used on entrance to an exception vector" name="" value="0x0"/>
      </value-group>
